# Menghapus missing values pada Data Frame

# Import Modules

In [8]:
import pandas as pd

print(pd.__version__)

2.1.4

# Persiapan Data Frame

In [14]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  0.814493  1.055119  0.865392 -0.694580
1      1 -3.023286 -0.936202 -0.949197       NaN
2      2  1.324671 -0.863608 -1.279146  0.644081
3      3 -2.206273       NaN -1.318047 -0.523883
4      4  1.690529 -0.233441 -1.021488  0.602228

In [15]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  0.814493  1.055119  0.865392 -0.694580
1  1 -3.023286 -0.936202 -0.949197       NaN
2  2  1.324671 -0.863608 -1.279146  0.644081
3  3 -2.206273       NaN -1.318047 -0.523883
4  4  1.690529 -0.233441 -1.021488  0.602228

In [16]:
df_backup = df.copy(deep=True)

# Menghapus (drop) setiap kolom yang mengandung missing values

In [21]:
df = df.dropna(axis='columns') 
df.head()

   Z         A         B         C         D
0  0  0.814493  1.055119  0.865392 -0.694580
2  2  1.324671 -0.863608 -1.279146  0.644081
4  4  1.690529 -0.233441 -1.021488  0.602228
8  8 -0.124826 -1.510213 -1.391279 -0.616211
9  9  1.360544  1.154818  0.275661  0.528357

# Menghapus (drop) setiap baris yang mengandung missing values

In [22]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
0  0  0.814493  1.055119  0.865392 -0.694580
2  2  1.324671 -0.863608 -1.279146  0.644081
4  4  1.690529 -0.233441 -1.021488  0.602228
8  8 -0.124826 -1.510213 -1.391279 -0.616211
9  9  1.360544  1.154818  0.275661  0.528357

# Persentase missing values untuk tiap kolom

In [23]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.233333
B    0.233333
C    0.300000
D    0.300000
dtype: float64

# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [27]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4